# Домашнее задание к занятию "7.4. Средства командной работы над инфраструктурой."

## Задача 3
Напишите программу для перевода метров в футы...
```
package main
import "fmt"
const rate = 0.3048
func main() {
        fmt.Print("Расстояние в метрах: ")
        var input float64
        fmt.Scanf("%f", &input)

        output := input * rate

        fmt.Print("Расстояние в футах: ")
        fmt.Println(output)
}
```

Напишите программу, которая найдет наименьший элемент в любом заданном списке.
```
package main

import "fmt"

func main() {
        values := []int{48, 96, 86, 68, 57, 82, 63, 70, 37, 34, 83, 27, 19, 97, 9, 17}

        min := values[0]
        for _, v := range values {
                if v < min {
                        min = v
                }
        }

        fmt.Print("Наименьшее число: ")
        fmt.Println(min)
}
```

Напишите программу, которая выводит числа от 1 до 100, которые делятся на 3. 
```
package main

import "fmt"
  func main() {
    mxcnt := 100 
    mxtxt := fmt.Sprintf("Числа до %d, делящиеся на три: ", mxcnt)
    for i := 1; i <= (mxcnt); i++ {
        if ((i-1)) ==0 {
           fmt.Print(mxtxt)
        }
        if (i%3) == 0 {
           fmt.Print(i,", ")
        }
        if (i) ==0 {
           fmt.Println()
        }
    }
  }
```